99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_config.c
/* Capture only: these helpers never call a native driver or acquire owners. */
static bool wifi_configuration_unsupported(JSContext *ctx)
{
    esp32_mquickjs_wifi_throw_configuration_error(ctx, ESP_ERR_NOT_SUPPORTED, NULL, NULL);
    return false;
}

static bool wifi_configuration_bool(JSContext *ctx, JSValue object, const char *key,
    bool *present, bool *output)
{
    JSValue value = JS_GetPropertyStr(ctx, object, key);
    if (JS_IsException(value)) return false;
    *present = !JS_IsUndefined(value);
    if (!*present) return true;
    if (!JS_IsBool(value)) return false;
    *output = value == JS_TRUE;
    return true;
}

static bool wifi_capture_configuration_country(JSContext *ctx, JSValue input,
    esp32_mquickjs_wifi_radio_config_controls_t *controls, bool details_only)
{
    static const char *const keys[] = {"code", "policy", "startChannel", "channelCount",
        "environment", "ghz5ChannelMask"};
    static const char *const policies[] = {"auto", "manual"};
    static const char *const environments[] = {"indoor", "outdoor", "X"};
    JSGCRef root_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    JSCStringBuf buffer;
    bool ok = false, object = !JS_IsString(ctx, input);
    bool first = false, count = false, environment = false, mask = false;
    uint32_t number;
    size_t length, choice;
    *root = input;
    if (details_only && !object) goto done;
    if (object && !esp32_mquickjs_validate_plain_options(ctx, *root,
        details_only ? "wifi.driver.setCountryDetails" : "wifi.configure country",
        keys, sizeof(keys) / sizeof(keys[0]))) goto done;
    *value = object ? JS_GetPropertyStr(ctx, *root, "code") : *root;
    const char *code;
    if (!JS_IsString(ctx, *value) || (code = JS_ToCStringLen(ctx, &length, *value, &buffer)) == NULL ||
        length != 2 || !((code[0] >= 'A' && code[0] <= 'Z' && code[1] >= 'A' && code[1] <= 'Z') ||
                        (code[0] == '0' && code[1] == '1'))) goto done;
    memcpy(controls->country.cc, code, 2);
    controls->country.policy = WIFI_COUNTRY_POLICY_AUTO;
    if (object) {
        *value = JS_GetPropertyStr(ctx, *root, "policy");
        if (JS_IsException(*value)) goto done;
        if (!JS_IsUndefined(*value)) {
            if (!esp32_mquickjs_value_to_enum(ctx, *value, policies, 2, &choice)) goto done;
            controls->country.policy = choice == 0 ? WIFI_COUNTRY_POLICY_AUTO : WIFI_COUNTRY_POLICY_MANUAL;
        }
        *value = JS_GetPropertyStr(ctx, *root, "startChannel");
        if (JS_IsException(*value)) goto done;
        first = !JS_IsUndefined(*value);
        if (first) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, 14, &number)) goto done;
            controls->country.schan = number;
        }
        *value = JS_GetPropertyStr(ctx, *root, "channelCount");
        if (JS_IsException(*value)) goto done;
        count = !JS_IsUndefined(*value);
        if (count) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, 14, &number)) goto done;
            controls->country.nchan = number;
        }
        *value = JS_GetPropertyStr(ctx, *root, "environment");
        if (JS_IsException(*value)) goto done;
        environment = !JS_IsUndefined(*value);
        if (environment && !JS_IsNull(*value)) {
            if (!esp32_mquickjs_value_to_enum(ctx, *value, environments, 3, &choice)) goto done;
            controls->country.cc[2] = choice == 0 ? 'I' : choice == 1 ? 'O' : 'X';
        }
        *value = JS_GetPropertyStr(ctx, *root, "ghz5ChannelMask");
        if (JS_IsException(*value)) goto done;
        mask = !JS_IsUndefined(*value);
        if (mask) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, UINT32_MAX, &number)) goto done;
#if CONFIG_SOC_WIFI_SUPPORT_5G
            controls->country.wifi_5g_channel_mask = number;
#else
            if (details_only) JS_ThrowTypeError(ctx, "5 GHz country mask requires a 5 GHz Wi-Fi target");
            else (void)wifi_configuration_unsupported(ctx);
            goto done;
#endif
        }
    }
    bool details = first || count || environment || mask;
    if (details_only && !details) goto done;
    if (details && (!first || !count)) goto done;
    controls->country_by_code = !details;
    controls->country_set = true;
    ok = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &root_ref);
    return ok;
}

bool esp32_mquickjs_wifi_capture_country_details(JSContext *ctx, JSValue input, wifi_country_t *country)
{
    if (country == NULL) return false;
    memset(country, 0, sizeof(*country));
    esp32_mquickjs_wifi_radio_config_controls_t controls = {0};
    if (!wifi_capture_configuration_country(ctx, input, &controls, true) ||
        esp32_mquickjs_wifi_radio_validate_config_controls(WIFI_MODE_STA, &controls) != ESP_OK) {
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "Invalid country details; startChannel and channelCount are required");
        return false;
    }
    *country = controls.country;
    return true;
}

bool esp32_mquickjs_wifi_capture_protocol(JSContext *ctx, JSValue input, uint16_t *output)
{
    static const char *const names[] = {"11b", "11g", "11n", "lr", "11a", "11ac", "11ax"};
    static const uint16_t values[] = {WIFI_PROTOCOL_11B, WIFI_PROTOCOL_11G, WIFI_PROTOCOL_11N,
        WIFI_PROTOCOL_LR, WIFI_PROTOCOL_11A, WIFI_PROTOCOL_11AC, WIFI_PROTOCOL_11AX};
    JSGCRef root_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    bool ok = false;
    uint16_t bitmap = 0;
    uint32_t length;
    *root = input;
    if (!JS_IsArray(ctx, *root)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "length");
    if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, 7, &length)) goto done;
    for (uint32_t i = 0; i < length; ++i) {
        size_t choice;
        *value = JS_GetPropertyUint32(ctx, *root, i);
        if (!esp32_mquickjs_value_to_enum(ctx, *value, names, 7, &choice) || (bitmap & values[choice])) goto done;
        bitmap |= values[choice];
    }
    *output = bitmap;
    ok = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &root_ref);
    return ok;
}

static bool wifi_capture_configuration_phy(JSContext *ctx, JSValue input, bool bandwidth,
    esp32_mquickjs_wifi_radio_config_controls_t *controls)
{
    static const char *const interfaces[] = {"station", "access-point"};
    static const char *const protocols[] = {"ghz2", "ghz5"};
    static const char *const widths[] = {"ghz2MHz", "ghz5MHz"};
    const char *const *keys = bandwidth ? widths : protocols;
    JSGCRef root_ref, interface_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *object = JS_PushGCRef(ctx, &interface_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    bool ok = false, any = false;
    *root = input;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.configure interfaces", interfaces, 2)) goto done;
    for (size_t i = 0; i < 2; ++i) {
        *object = JS_GetPropertyStr(ctx, *root, interfaces[i]);
        if (JS_IsException(*object)) goto done;
        if (JS_IsUndefined(*object)) continue;
        if (!esp32_mquickjs_validate_plain_options(ctx, *object, "wifi.configure PHY", keys, 2)) goto done;
        uint8_t bands = 0;
        for (size_t band = 0; band < 2; ++band) {
            *value = JS_GetPropertyStr(ctx, *object, keys[band]);
            if (JS_IsException(*value)) goto done;
            if (JS_IsUndefined(*value)) continue;
            bands |= 1U << band;
            if (bandwidth) {
                uint32_t number;
                if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 20, 40, &number) ||
                    (number != 20 && number != 40)) goto done;
                wifi_bandwidth_t width = number == 20 ? WIFI_BW20 : WIFI_BW40;
                if (band == 0) controls->bandwidths[i].ghz_2g = width;
                else controls->bandwidths[i].ghz_5g = width;
            } else {
                uint16_t bitmap;
                if (!esp32_mquickjs_wifi_capture_protocol(ctx, *value, &bitmap)) goto done;
                if (band == 0) controls->protocols[i].ghz_2g = bitmap;
                else controls->protocols[i].ghz_5g = bitmap;
            }
        }
        if (bands == 0) goto done;
        if (bandwidth) controls->bandwidth_bands[i] = bands;
        else controls->protocol_bands[i] = bands;
        any = true;
    }
    ok = any;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &interface_ref);
    JS_PopGCRef(ctx, &root_ref);
    return ok;
}

static bool wifi_capture_lifecycle_timeout(JSContext *ctx, JSValue options,
    const char *operation, uint32_t default_ms, uint32_t *timeout_ms)
{
    static const char *const keys[] = {"timeoutMs"};
    if (timeout_ms == NULL) {
        JS_ThrowTypeError(ctx, "missing native Wi-Fi lifecycle timeout");
        return false;
    }
    *timeout_ms = 0;
    if (JS_IsUndefined(options)) { *timeout_ms = default_ms; return true; }
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    bool ok = false;
    uint32_t captured = default_ms;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, operation, keys, 1)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "timeoutMs");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value) &&
        !esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, INT32_MAX, &captured)) {
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "%s timeoutMs expects an integer from 1 to 2147483647", operation);
        goto done;
    }
    *timeout_ms = captured;
    ok = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

bool esp32_mquickjs_wifi_capture_stop(JSContext *ctx, JSValue options, uint32_t *timeout_ms)
{
    return wifi_capture_lifecycle_timeout(ctx, options, "wifi.stop", 1000, timeout_ms);
}

bool esp32_mquickjs_wifi_capture_stop_ap_timeout(JSContext *ctx, JSValue options, uint32_t *timeout_ms)
{
    return wifi_capture_lifecycle_timeout(ctx, options, "wifi.stopAP", 1000, timeout_ms);
}

