99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_config.c
bool esp32_mquickjs_wifi_capture_disconnect(JSContext *ctx, JSValue options, uint32_t *timeout_ms)
{
    return wifi_capture_lifecycle_timeout(ctx, options, "wifi.disconnect", ESP32_MQUICKJS_WIFI_DEFAULT_TIMEOUT_MS, timeout_ms);
}

bool esp32_mquickjs_wifi_capture_restart(JSContext *ctx, JSValue options, uint32_t *timeout_ms, bool *allow_ap_restart)
{
    static const char *const keys[] = {"timeoutMs", "allowApRestart"};
    if (timeout_ms == NULL || allow_ap_restart == NULL) {
        JS_ThrowTypeError(ctx, "missing native Wi-Fi restart options");
        return false;
    }
    *timeout_ms = 0;
    *allow_ap_restart = false;
    if (JS_IsUndefined(options)) { *timeout_ms = 10000; return true; }
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    bool ok = false, captured_ap = false;
    uint32_t captured = 10000;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.driver.restart", keys, 2)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "timeoutMs");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value) &&
        !esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, INT32_MAX, &captured)) {
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "wifi.driver.restart timeoutMs expects an integer from 1 to 2147483647");
        goto done;
    }
    *value = JS_GetPropertyStr(ctx, *root, "allowApRestart");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!JS_IsBool(*value)) {
            JS_ThrowTypeError(ctx, "wifi.driver.restart allowApRestart expects a boolean");
            goto done;
        }
        captured_ap = *value == JS_TRUE;
    }
    *timeout_ms = captured;
    *allow_ap_restart = captured_ap;
    ok = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

#if CONFIG_ESP_WIFI_WAPI_PSK
bool esp32_mquickjs_wifi_capture_wapi_control(JSContext *ctx, JSValue options, bool enable, uint32_t *timeout_ms)
{
    return wifi_capture_lifecycle_timeout(ctx, options, enable ? "wifi.wapi.enable" : "wifi.wapi.disable", 10000, timeout_ms);
}
#endif

bool esp32_mquickjs_wifi_capture_start(JSContext *ctx, JSValue options,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection)
{
    static const char *const keys[] = {"mode", "storage"};
    static const char *const modes[] = {"station", "ap", "apsta"};
    static const wifi_mode_t mode_values[] = {WIFI_MODE_STA, WIFI_MODE_AP, WIFI_MODE_APSTA};
    static const char *const storages[] = {"ram", "flash"};
    if (selection == NULL) {
        JS_ThrowTypeError(ctx, "missing native Wi-Fi start selection");
        return false;
    }
    memset(selection, 0, sizeof(*selection));
    selection->start_only = true;
    selection->start = selection->start_set = true;
    if (JS_IsUndefined(options)) return true;
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    bool ok = false;
    size_t choice;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.start", keys, 2)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "mode");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *value, modes, 3, &choice)) {
            if (!JS_HasException(ctx))
                JS_ThrowTypeError(ctx, "wifi.start mode must be station, ap or apsta");
            goto done;
        }
        selection->mode_set = true;
        selection->mode = mode_values[choice];
    }
    *value = JS_GetPropertyStr(ctx, *root, "storage");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *value, storages, 2, &choice)) {
            if (!JS_HasException(ctx))
                JS_ThrowTypeError(ctx, "wifi.start storage must be ram or flash");
            goto done;
        }
        selection->storage_set = true;
        selection->storage = choice == 0 ? WIFI_STORAGE_RAM : WIFI_STORAGE_FLASH;
    }
    ok = true;
done:
    if (!ok) memset(selection, 0, sizeof(*selection));
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

bool esp32_mquickjs_wifi_capture_configuration(JSContext *ctx, JSValue options,
    esp32_mquickjs_wifi_configuration_t *configuration)
{
    static const char *const keys[] = {"mode", "storage", "start", "allowDisconnect", "station", "accessPoint",
        "country", "protocols", "bandwidths", "txPowerDbm", "powerSave"};
    static const char *const modes[] = {"station", "ap", "apsta"};
    static const wifi_mode_t mode_values[] = {WIFI_MODE_STA, WIFI_MODE_AP, WIFI_MODE_APSTA};
    static const char *const storage[] = {"ram", "flash"};
    static const char *const power_save[] = {"none", "minimum", "maximum"};
    static const wifi_ps_type_t power_values[] = {WIFI_PS_NONE, WIFI_PS_MIN_MODEM, WIFI_PS_MAX_MODEM};
    if (configuration == NULL) {
        JS_ThrowTypeError(ctx, "missing native Wi-Fi configuration storage");
        return false;
    }
    memset(configuration, 0, sizeof(*configuration));
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    bool ok = false, present;
    size_t choice;
    *root = options;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.configure", keys, sizeof(keys) / sizeof(keys[0]))) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "mode");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *value, modes, 3, &choice)) goto done;
        configuration->mode_set = true;
        configuration->mode = mode_values[choice];
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        if (configuration->mode & WIFI_MODE_AP) { (void)wifi_configuration_unsupported(ctx); goto done; }
#endif
    }
    *value = JS_GetPropertyStr(ctx, *root, "storage");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *value, storage, 2, &choice)) goto done;
        configuration->storage_set = true;
        configuration->storage = choice == 0 ? WIFI_STORAGE_RAM : WIFI_STORAGE_FLASH;
    }
    if (!wifi_configuration_bool(ctx, *root, "start", &configuration->start_set, &configuration->start) ||
        !wifi_configuration_bool(ctx, *root, "allowDisconnect", &present, &configuration->allow_disconnect)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "country");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value) && !wifi_capture_configuration_country(ctx, *value, &configuration->controls, false)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "protocols");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value) && !wifi_capture_configuration_phy(ctx, *value, false, &configuration->controls)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "bandwidths");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value) && !wifi_capture_configuration_phy(ctx, *value, true, &configuration->controls)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "txPowerDbm");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        double power;
        if (!JS_IsNumber(ctx, *value) || JS_ToNumber(ctx, &power, *value) != 0 ||
            !isfinite(power) || power < 2 || power > 20 || floor(power * 4) != power * 4) goto done;
        configuration->start_controls.tx_power_set = true;
        configuration->start_controls.tx_power_quarter_dbm = (int8_t)(power * 4);
    }
    *value = JS_GetPropertyStr(ctx, *root, "powerSave");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *value, power_save, 3, &choice)) goto done;
        configuration->controls.power_save_set = true;
        configuration->controls.power_save = power_values[choice];
    }
    *value = JS_GetPropertyStr(ctx, *root, "station");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_wifi_parse_driver_config(ctx, *value, WIFI_IF_STA, &configuration->station)) goto done;
        configuration->station_set = true;
    }
    *value = JS_GetPropertyStr(ctx, *root, "accessPoint");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_wifi_parse_driver_config(ctx, *value, WIFI_IF_AP, &configuration->access_point)) goto done;
        configuration->access_point_set = true;
    }
    if (configuration->mode_set && ((configuration->station_set && !(configuration->mode & WIFI_MODE_STA)) ||
        (configuration->access_point_set && !(configuration->mode & WIFI_MODE_AP)))) goto done;
    /* Missing selections remain missing. APSTA here is only a validation
     * superset, not a default mode or permission to initialize an AP. */
    wifi_mode_t validation_mode = configuration->mode_set ? configuration->mode : WIFI_MODE_APSTA;
    esp_err_t validation = esp32_mquickjs_wifi_radio_validate_config_controls(validation_mode, &configuration->controls);
    if (validation == ESP_OK) validation = esp32_mquickjs_wifi_radio_validate_start_controls(
        !configuration->start_set || configuration->start, &configuration->start_controls);
    if (validation == ESP_ERR_NOT_SUPPORTED) { (void)wifi_configuration_unsupported(ctx); goto done; }
    if (validation != ESP_OK) goto done;
    ok = true;
done:
    if (!ok) {
        esp32_mquickjs_wireless_secure_zero(configuration, sizeof(*configuration));
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid or conflicting wifi.configure options");
    }
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}
#endif
